import 'package:code/src/Base/common/file_export.dart';
import 'package:url_launcher/url_launcher.dart';
import 'package:webview_flutter/webview_flutter.dart';

class PrivacyScreen extends StatelessWidget {
  WebViewController? _webController;
String? str = r"""<!-- HTML Codes by Quackit.com -->
<!DOCTYPE html>
<title>Text Example</title>
<style>
div.container {
background-color: #ffffff;
}
div.container p {
font-family: Arial;
font-size: 14px;
font-style: normal;
font-weight: bold;
text-decoration: none;
text-transform: none;
color: #00ff00;
background-color: #ffffff;
}
</style>

<div _ngcontent-mut-c170="" class="bv"><div _ngcontent-mut-c170="" class="container">
<div _ngcontent-mut-c170="" class="row"><div _ngcontent-mut-c170="" class="col-12 col-lg-12">
<div _ngcontent-mut-c170="" class="m-crd pr"><h6 _ngcontent-mut-c170="" class="mb-4">إشعار الخصوصية </h6>
<p _ngcontent-mut-c170="" class="mb-3"> يُعتبر إشعار الخصوصية 
الموضح أدناه جزءًا من شروط استخدامك للبوابة الالكترونية للهيئة العامة للنقل. </p><p _ngcontent-mut-c170="" class="mb-3"> تلتزم الهيئة العامة للنقل بالحفاظ على سرية البيانات الشخصية لضمان وحفظ حقوق أصحاب البيانات، وتمتثل الهيئة لسياسات حوكمة البيانات الوطنية والتشريعات الأساسية لحماية حقوق وخصوصية الأفراد فيما يتعلق ببياناتهم الشخصية، والتي تخضع لنظام حماية البيانات الشخصية. </p><h5 _ngcontent-mut-c170="" class="start-in"> الموافقة على إشعار الخصوصية </h5><p _ngcontent-mut-c170="" class="mb-3"> تقوم الهيئة العامة للنقل بجمع البيانات الشخصية عند زيارة البوابة الالكترونية وذلك لتقديم خدمات ذات جودة عالية، ويعتبر استخدامك لبوابة الهيئة والمنصات التابعة لها موافقةً منك على هذا الإشعار. </p>
<h5 _ngcontent-mut-c170="" class="start-in">ما هي البيانات الشخصية التي نجمعها </h5>
<h4 _ngcontent-mut-c170="" class="start-in">
<b _ngcontent-mut-c170="">1- ملفات تعريف الارتباط (Cookies) </b></h4><p _ngcontent-mut-c170=""> قد يقوم الموقع بتخزين ما يسمى بملفات تعريف الارتباط "Cookies" على الجهاز المحمول الخاص بك عندما تقوم بزيارة موقع الهيئة العامة للنقل. إن ملفات تعريف الارتباط "Cookies" هي جزء من البيانات التي تحددك كمستخدم بشكل فريد، كما يمكن استخدامها لتطوير معرفتك بموقع الهيئة العامة للنقل وفهم تجربة المستخدم على نحو أفضل.و من هذه البيانات المحفوظة: </p>
<div _ngcontent-mut-c170="" class="box-skils"><ul _ngcontent-mut-c170="">
<li _ngcontent-mut-c170="">تذكر اسم مستخدم وكلمة مرور.</li>
<li _ngcontent-mut-c170="">حفظ إعدادات الصفحة في حال كان ذلك متاح على البوابة.</li>
<li _ngcontent-mut-c170="">حفظ الألوان التي تم اختيارها من قبل المستخدم.</li></ul></div>
<h4 _ngcontent-mut-c170="" class="start-in">
<b _ngcontent-mut-c170="">2- البيانات الشخصية</b>
</h4><p _ngcontent-mut-c170="">تقوم الهيئة العامة للنقل بجمع بعض البيانات الشخصية عند استخدام الخدمات الالكترونية أو وسائل الاتصال الخاصة بالهيئة، مع إمكانية مشاركة بعض البيانات مع الجهات الحكومية لغرض تسهيل رحلة المستفيد ورفع مستوى الجودة.</p>
<p _ngcontent-mut-c170="">مثل : الاسم ، أرقام التواصل ، البريد الشخصي ، العنوان ، الهوية أو رقم الإقامة.</p><h4 _ngcontent-mut-c170="" class="start-in"><b _ngcontent-mut-c170="">3- الموقع الجغرافي </b></h4><p _ngcontent-mut-c170="">قد يُطلب من المستخدم في بعض الأحيان الموافقة على تحديد الموقع الجغرافي له، للاستفادة من بعض الخدمات المقدمة في موقع الهيئة العامة للنقل.</p><h5 _ngcontent-mut-c170="" class="start-in">كيف نستخدم بياناتك الشخصية</h5>
<div _ngcontent-mut-c170="" class="box-skils"><ul _ngcontent-mut-c170=""><li _ngcontent-mut-c170="">استخدام موقع الهيئة العامة للنقل لبروتوكول الإنترنت الخاص بك يساعد على تشخيص المشكلات التي تحدث في الخوادم الخاصة بها، ويساعدها أيضًا على إجراء الإحصاء اللازم لقياس استخدام الموقع (عدد الزوار ولغة جهاز الكمبيوتر الذي تستخدمه ونوع المتصفح)، لا يسمح لأي جهة خارج إطار الفريق الفني لها بالاطلاع على بروتوكول الإنترنت الخاص بك.</li>
<li _ngcontent-mut-c170="">تحسين تجربة المستخدم من خلال تحسين وتطوير موقع الهيئة العامة للنقل لتلبية احتياجات وخدمات المستخدمين.</li>
<li _ngcontent-mut-c170="">تحسين خدمة المستفيدين من خلال الاستجابة بشكل أكثر فعالية لطلبات خدمة العملاء واحتياجات الدعم.</li><li _ngcontent-mut-c170="">قد نستخدم تقرير " Google" التحليلي للقيام بتحليلات مواقع الويب التي تحصل على معلوماتها من عناوين بروتوكول الإنترنت، لإظهار المعلومات المعروضة مثل: البلد، المدينة، الجهاز، الصفحات التي تمت زيارتها، ووقت الجلسة لكل صفحة تمت زيارتها، وتستخدم هذه التقارير داخليًا فقط لأغراض التحليل وتطوير الموقع.</li><li _ngcontent-mut-c170="">إرسال رسائل البريد الإلكتروني و الرسائل النصية الدورية –لمعالجة الطلبات، وقد يستخدم لإرسال المعلومات والتحديثات إلى طلبك بالإضافة إلى تلقي أخبار الهيئة العامة للنقل العامة والتحديثات والمنتجات ذات الصلة.</li></ul></div><h5 _ngcontent-mut-c170="" class="start-in">الأساس النظامي لجمع ومعالجة بياناتك الشخصية </h5>
<div _ngcontent-mut-c170="" class="box-skils">
<p _ngcontent-mut-c170="" class="mb-3">وفقاً لنظام حماية البيانات الشخصية في السعودية و لسياسة حماية البيانات الشخصية الصادرة من مكتب إدارة البيانات الوطنية، فإن الأساس النظامي الذي نعتمد عليه لمعالجة هذه البيانات هو: </p><ul _ngcontent-mut-c170=""><li _ngcontent-mut-c170="">موافقتك الصريحة، ويمكنك التراجع عن الموافقة في أي وقت ما عدا بعض الاستثناءات الموضحة أعلاه وللقيام بذلك يمكنك التواصل من خلال بيانات التواصل الموضحة أدناه.</li>
<li _ngcontent-mut-c170="">تحقيق المصلحة العامة: من خلال تسهيل وتحسين إجراءات الجهات الحكومية ذات العلاقة.</li></ul></div><h5 _ngcontent-mut-c170="" class="start-in">حماية بياناتك الشخصية</h5>
<p _ngcontent-mut-c170="" class="mb-2">ستكون بياناتك الشخصية متاحة فقط لموظفي الهيئة أو لموظفي الأطراف الثالثة المصرّح لهم بالاطلاع عليها، كما نؤكد بتطبيق الإجراءات التنظيمية والتدابير الأمنية المناسبة لحماية بياناتك من أي إفصاح أو معالجة غير مصرح بها، ولن تكون تلك البيانات متاحة للعامة، ولن يتم تبادل أو تداول أي من تلك البيانات أو بيعها لأي طرف آخر من غير الموافقة المسبقة لصاحب البيانات إلا في حالة الامتثال للسياسات و الأنظمة والقوانين ذات العلاقة.</p>
<p _ngcontent-mut-c170="" class="mb-3">كما لن يسمح بالوصول إلى المعلومات إلا للأشخاص المؤهلين والذين يتولون تقديم خدمات موقع الهيئة العامة للنقل ،والجهات الحكومية التي تساهم في تطوير الخدمات وتسهيل إجراءات رحلة المستفيد، ويتم تطبيق نظام حماية البيانات الشخصية واتباع سياسات حماية البيانات الشخصية الصادرة من مكتب إدارة البيانات الوطنية المتعلقة بأمن البيانات الشخصية.</p>
<h5 _ngcontent-mut-c170="" class="start-in">مشاركة بياناتك الشخصية</h5><p _ngcontent-mut-c170="" class="mb-1">قد يتم مشاركة البيانات الشخصية مع جهات حكومية ذات العلاقة ، على أن يتم مشاركتها لأغراض مشروعة في سبيل تحسين تجربة المستفيد أو لأغراض أخرى تحقق أهداف و مصالح وطنية.</p><p _ngcontent-mut-c170="" class="mb-1">وبتقديمك لبياناتك ومعلوماتك الشخصية من خلال البوابة الإلكترونية للهيئة، فإنك توافق تمامًا على تخزين ومعالجة واستخدام تلك البيانات من قِبل السلطات السعودية، ونحن نحتفظ بالحق في كل الأوقات في كشف أي معلومات للجهات المختصة، عندما يكون ذلك ضروريًا للالتزام بأي قانون أو نظام أو طلب حكومي.</p>
<p _ngcontent-mut-c170="" class="mb-1">لن نشارك بياناتك الشخصية مع الجهات غير الحكومية إلا إذا كانت من الجهات المصرح لها من الجهات المختصة بالقيام بأداء خدمات حكومية محددة.</p>
<h5 _ngcontent-mut-c170="" class="start-in">حقوق صاحب البيانات</h5><b _ngcontent-mut-c170="" class="start-in">يحق لصاحب البيانات الذي يزوّد بياناته الشخصية لموقع الهيئة، ما يلي:</b><div _ngcontent-mut-c170="" class="box-skils"><ul _ngcontent-mut-c170=""><li _ngcontent-mut-c170="">الحق في الوصول إلى بياناتك الشخصية: وذلك بطلب نسخة من بياناتك الشخصية عبر البريد الالكتروني الموضح في بيانات التواصل، وسيتم الرد عليك خلال [ 5 ] أيام عمل.</li>
<li _ngcontent-mut-c170="">الحق في تصحيح بياناتك الشخصية: وذلك بطلب تصحيح بياناتك الشخصية التي ترى أنها غير دقيقة أو غير صحيحة أو غير مكتملة وذلك عبر البريد الإلكتروني الموضح في بيانات التواصل، وسيتم مراجعتها وتحديثها خلال [ 5 ] أيام عمل ويتم اشعارك بذلك عن طريق [ معلومات التواصل الخاصة بك ].</li><li _ngcontent-mut-c170="">الحق في إتلاف بياناتك الشخصية: وذلك بطلب مسح بياناتك الشخصية في ظروف معينة بما لا يتعارض مع الأسس النظامية و المصالح المشروعة.</li>
<li _ngcontent-mut-c170="">الحق في تقييد المعالجة: وذلك بطلب تقييد معالجة بياناتك الشخصية في ظروف معينة ولفترة زمنية محددة.</li>
<li _ngcontent-mut-c170="">الحق في الاعتراض على المعالجة: وذلك بالاعتراض على معالجة بياناتك الشخصية في الحالات التالية [ لأغراض التسويق المباشر – لمهام محددة يتم تنفيذها للمصلحة العامة أو لأهدافنا المشروعة ].</li><li _ngcontent-mut-c170="">الحق في نقل بياناتك الشخصية: وذلك بطلب نقل بياناتك الشخصية – التي يتم جمعها عن طريقك مباشرة إلى جهة أخرى بمقابل مادي، ولا يمكن ممارسة هذا الحق إلا إذا كانت موافقتك هي الأساس النظامي.</li></ul></div><h5 _ngcontent-mut-c170="" class="start-in">التزامات جهات المعالجة </h5>
<b _ngcontent-mut-c170="" class="start-in">تلتزم أي جهة معالجة تعالج البيانات الشخصية ، حصلت على قبول للترخيص من الهيئة العامة للنقل بالتالي: </b>
<div _ngcontent-mut-c170="" class="box-skils"><ul _ngcontent-mut-c170=""><li _ngcontent-mut-c170="">تطبيق أحكام ومبادئ نظام حماية البيانات الشخصية و سياسات حماية البيانات الشخصية المعمول بها في المملكة ، و يعتبر استخدامك و موافقتك لبوابة الهيئة العامة للنقل موافقتك بالالتزام بها. </li><li _ngcontent-mut-c170="">تخزين البيانات الشخصية ومعالجتها داخل الحدود الجغرافية للمملكة لضمان المحافظة على السيادة الوطنية الرقمية لهذه البيانات، ولا يجوز معالجتها خارج المملكة إلا بعد الحصول على الموافقة الكتابية من الجهات التنظيمية.</li>
<li _ngcontent-mut-c170="">أن يتم حماية البيانات الشخصية من التسرب، أو التلف، أو الفقدان، أو الاختلاس، أو إساءة الاستخدام، أو التعديل أو الوصول غير المصرّح به – وفقاً لما يصدر من الهيئة الوطنية للأمن السيبراني والجهات ذات الاختصاص.
</li><li _ngcontent-mut-c170="">يحظر مشاركة البيانات الشخصية مع جهات أخرى إلا وفقاً للأغراض المحددة بعد موافقة صاحب البيانات ووفقاً للأنظمة واللوائح والسياسات على أن يتم تزويد الجهات الأخرى بسياسات وإجراءات الخصوصية المتبعة وتضمينها في العقود والاتفاقيات.</li>
<li _ngcontent-mut-c170="">استخدام التدابير الأمنية المناسبة – كالتشفير، وغيره – لأمن البيانات الشخصية وحمايتها بما يتناسب مع طبيعتها وحساسيتها والوسائط المستخدمة لنقلها وتخزينها وفقاً لما يصدر من الهيئة الوطنية للأمن السيبراني والجهات ذات الاختصاص.</li><li _ngcontent-mut-c170="">إجراء التقييم الدوري للمخاطر والآثار المحتملة لأنشطة معالجة البيانات الشخصية .</li></ul></div>
<h5 _ngcontent-mut-c170="" class="start-in">التغييرات التي قد تطرأ على إشعار الخصوصية</h5><p _ngcontent-mut-c170="" class="mb-1">يجب على المستخدمين الاطلاع بشكل مستمرعلي إشعار الخصوصية، والذي قد يطرأ عليه تغيير في أي وقت. سيتم نشر التحديثات في صفحة إشعار الخصوصية مع الإشارة إلى آخر تحديث أُجري عليها.</p>
<p _ngcontent-mut-c170="" class="mb-1">تحتفظ الهيئة بحقها في تعديل إشعار الخصوصية عند الضرورة، ويصبح أي تعديل للبنود والشروط نافذًا فور اعتماده دون أي التزام بالإعلان.</p><h5 _ngcontent-mut-c170="" class="start-in">تواصل معنا</h5><p _ngcontent-mut-c170="">في حال وجود أي اسئلة أو استفسارات حول إشعار الخصوصية الخاص ب الهيئة العامة للنقل ، فيمكنك التواصل معنا من خلال التالي: </p><div _ngcontent-mut-c170="" class="box-skils"><p _ngcontent-mut-c170="">الفريق المختص : مكتب إدارة البيانات</p>
<p _ngcontent-mut-c170="">البريد الإلكــتروني : DMO@tga.gov.sa</p><div _ngcontent-mut-c170="" class="box-skils">
<p _ngcontent-mut-c170="">التشريعات ذات العلاقة</p>
<ul _ngcontent-mut-c170="">
<li _ngcontent-mut-c170="">
<a _ngcontent-mut-c170="" href="https://laws.boe.gov.sa/BoeLaws/Laws/LawDetails/b7cfae89-828e-4994-b167-adaa00e37188/1" target="_blank">نظام وسياسة حماية البيانات الشخصية </a></li><li _ngcontent-mut-c170="">
<a _ngcontent-mut-c170="" href="https://sdaia.gov.sa/ndmo/Files/PoliciesAr.pdf">سياسات حوكمة البيانات الوطنية</a></li><li _ngcontent-mut-c170="">
<a _ngcontent-mut-c170="" href="https://ega.ee/wp-content/uploads/2019/03/Essential-Cybersecurity-Controls.pdf">الضوابط الأساسية للأمن السيبراني</a></li><li _ngcontent-mut-c170="">
<a _ngcontent-mut-c170="" href="https://laws.boe.gov.sa/BoeLaws/Laws/LawDetails/6f509360-2c39-4358-ae2a-a9a700f2ed16/1">نظام التعاملات الالكترونية</a></li></ul></div></div></div>

</div></div></div></div>""";

  @override
  Widget build(BuildContext context) {

    return NetworkIndicator(
      child: PageContainer(
        child: Directionality(
          textDirection: translator.activeLanguageCode == 'ar'
              ? TextDirection.rtl
              : TextDirection.ltr,
          child:Scaffold(
          appBar: AppBarWidget.appBarWidget(
              context: context,
              icon: true,
              route: Index()

          ),
          backgroundColor: kWhiteColor,
          body:  Container(
                      height: Shared.height,
                      padding: EdgeInsets.only(top: 10),
                      decoration: BoxDecoration(
                        color: kWhiteColor,
                        borderRadius: BorderRadius.only(
                            topRight: Radius.circular(Shared.width * 0.08),
                            topLeft: Radius.circular(Shared.width * 0.08)),
                      ),
                      child: Container(
                        padding: EdgeInsets.symmetric(
                            horizontal: Shared.width * 0.05,vertical: Shared.width * 0.0),
                        child: ListView(

                          physics: AlwaysScrollableScrollPhysics(),
                          children: [
                            Html(
                              data: str,
                              onLinkTap: (url, _, __, ___) async {
                                await launchUrl(Uri.parse(url!),
                                  mode: LaunchMode.inAppWebView,
                                  webViewConfiguration: const WebViewConfiguration(
                                      headers: <String, String>{'my_header_key': 'my_header_value'}),);

                              },
                            ),
                          ],

                        ),
                      )
                  ),),
            ),


      ),
    );
  }
}
